Returns all parameters of this subelement.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
  Since:  2018
 Syntax
  C#
public IList<ElementId> GetAllParameters()
  Visual Basic
Public Function GetAllParameters As IList(Of ElementId)
  Visual C++
public:
IList<ElementId^>^ GetAllParameters()
 See Also
  Subelement Class
  Autodesk.Revit.DB Namespace